app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "order_id", "total_price", "updated_at", "quanity") VALUES('2010-01-27 03:30:26', 2, 1, 14.97, '2010-01-27 03:30:26', 1)
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('Dani', '12 Old Harlow Rd', '2010-01-27 03:30:26', '2010-01-27 03:30:26', 'check', 'a@b.c')
---
  def save_order
  	@cart = find_cart
  	@order = Order.new(params[:order])
  	@order.add_line_items_from_cart(@cart)
  	if @order.save